progaurav052/MCU1_EMBEDDED_DRIVER_DEVELOPMENT/stm32f4xx_drivers/Src/spi_tx_testing.c
/*
 * main.c
 *
 *  Created on: Dec 21, 2025
 *      Author: ggpai
 */

#include "stm32f407xx.h"

void SPI_GPIOInits(void)
{
	// initialize the GPIO Port of your choice in AFMODE
	GPIO_Handle_t SPI_GpioPins;

	SPI_GpioPins.pGPIOx=GPIOB;
	SPI_GpioPins.GPIO_PinConfig.GPIO_PinAltFunMode=GPIO_ALTFN_5;
	SPI_GpioPins.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_ALTFN;
	SPI_GpioPins.GPIO_PinConfig.GPIO_PinOPType=GPIO_OP_TYPE_PP; // for I2c its OD mentioned in manual
	SPI_GpioPins.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_NO_PUPD;
	SPI_GpioPins.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_FAST;

	//enable the Peripheral clock
	GPIO_PeripheralClockControl(SPI_GpioPins.pGPIOx, ENABLE);


	// SCLK pin
    SPI_GpioPins.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_13;
    GPIO_Init(&SPI_GpioPins);

    // NSS
    //SPI_GpioPins.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_12;
    //GPIO_Init(&SPI_GpioPins);

    // MOSI
    SPI_GpioPins.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_15;
    GPIO_Init(&SPI_GpioPins);

    // MISO
    //SPI_GpioPins.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_14;
    //GPIO_Init(&SPI_GpioPins);


}

void SPI_Inits()
{
	SPI_Handle_t SPI_Pins;

	SPI_Pins.pSPIx=SPI2;
	SPI_Pins.SPIConfig.SPI_BusConfig=SPI_BUS_CONFIG_FD;
	SPI_Pins.SPIConfig.SPI_DeviceMode=SPI_DEVICE_MODE_MASTER;
	SPI_Pins.SPIConfig.SPI_CPHA=SPI_CPHA_LOW;
	SPI_Pins.SPIConfig.SPI_CPOL=SPI_CPOL_LOW;
	SPI_Pins.SPIConfig.SPI_DFF=SPI_DFF_8BITS;
	SPI_Pins.SPIConfig.SPI_SSM=SPI_SSM_EN; // we are using master only
	SPI_Pins.SPIConfig.SPI_SclkSpeed=SPI_SCLK_SPEED_DIV2;

	// enable the Peripheral clock
	SPI_PeripheralClockControl(SPI_Pins.pSPIx, ENABLE);

	//Initialize
	SPI_Init(&SPI_Pins);




}
int main()
{
	// Identified the GPIO pins we need to use in AF mode from Datasheet
	//GPIO initialize
	SPI_GPIOInits();

	//SPI initialize
	SPI_Inits();


	return 0;

}
